# Exercício
O objetivo desta tarefa é encontrar algum tipo de relação entre o atributo education e o atributo income da base de dados do censo.

Usar arquivos `census.csv`

## Importar arquivo

In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('../data/raw_data/census.csv')

In [3]:
dataset.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [9]:
# Crie um novo dataframe com o pandas utilizando somente esses dois campos
dataset_education_income = dataset[['education', 'income']]

#Utilizar o comando groupby para agrupar os dados baseado nesses dois atributos.
grouped_data = dataset_education_income.groupby(['education', 'income'])['education'].count()

In [13]:
grouped_data.head(10)

education  income
10th       <=50K      871
           >50K        62
11th       <=50K     1115
           >50K        60
12th       <=50K      400
           >50K        33
1st-4th    <=50K      162
           >50K         6
5th-6th    <=50K      317
           >50K        16
Name: education, dtype: int64

In [6]:
# Encontrar o valor relativo de cada item em education 
grouped_data['relative'] = (grouped_data['count'] / grouped_data['count'].sum()) * 100

In [7]:
grouped_data.sample(10)

        education  income  count  relative
15     Assoc-acdm    >50K    265  0.813857
24        Masters   <=50K    764  2.346365
6         1st-4th   <=50K    162  0.497528
10        7th-8th   <=50K    606  1.861122
30   Some-college    >50K   1387  4.259697
13            9th    >50K     27  0.082921
21      Doctorate    >50K    306  0.939775
28    Prof-school    >50K    423  1.299100
9         5th-6th    >50K     16  0.049139
12            9th   <=50K    487  1.495654

In [8]:
grouped_data.shape

(31, 4)

# Valores relativos ao bacharelado

In [14]:
grouped_data.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [15]:
total_bachelors = grouped_data[' Bachelors', ' <=50K'] + grouped_data[' Bachelors', ' >50K']
total_bachelors

5355

In [23]:
print(f'Bachareis com salários acima de 50.000 dolares: {(grouped_data[' Bachelors', ' >50K'] / total_bachelors) * 100:0.2f}%')
print(f'Bachareis com salários abaixo de 50.000 dolares: {(grouped_data[' Bachelors', ' <=50K'] / total_bachelors) * 100:0.2f}%')

Bachareis com salários acima de 50.000 dolares: 41.48%
Bachareis com salários abaixo de 50.000 dolares: 58.52%

# Valores relativos ao Doutorado

In [ ]:
total_Doctorate = grouped_data[' Doctorate', ' <=50K'] + grouped_data[' Doctorate', ' >50K']

In [ ]:
print(f'Doctorate com salários acima de 50.000 dolares: {(grouped_data[' Doctorate', ' >50K'] / total_Doctorate) * 100:0.2f}%')
print(f'Doctorate com salários abaixo de 50.000 dolares: {(grouped_data[' Doctorate', ' <=50K'] / total_Doctorate) * 100:0.2f}%')

Doctorate com salários acima de 50.000 dolares: 74.09%
Doctorate com salários abaixo de 50.000 dolares: 25.91%